In [1]:
import pandas as pd
import numpy as np

In [2]:
person = {
    "first": "Jef",
    "last": "Jon",
    "email": "jefjon@com.com"
}

In [3]:
people = {
    'first': ['Jef'],
    'last': ['Jon'],
    'email': ['jefjon@com.com']
}

In [4]:
people = {
    'first': ['Jef', 'Jon', 'Car', np.nan, None, 'NA'],
    'last': ['Jon', 'Car', 'Jef', np.nan, np.nan, 'Missing'],
    'email': ['jef@com.com', 'jon@com.com', 'car@com.com', None, np.nan, None],
    'age': ['33', '55', '63', None, None, 'Missing']
}

In [5]:
people['email']

['jef@com.com', 'jon@com.com', 'car@com.com', None, nan, None]

In [6]:
person['first']

'Jef'

In [7]:
df = pd.DataFrame(people)

df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

In [8]:
df

  first last        email   age
0   Jef  Jon  jef@com.com    33
1   Jon  Car  jon@com.com    55
2   Car  Jef  car@com.com    63
3   NaN  NaN         None  None
4  None  NaN          NaN  None
5   NaN  NaN         None   NaN

In [9]:
df['email']

0    jef@com.com
1    jon@com.com
2    car@com.com
3           None
4            NaN
5           None
Name: email, dtype: object

In [10]:
type(df['email'])

pandas.core.series.Series

In [11]:
df.email

0    jef@com.com
1    jon@com.com
2    car@com.com
3           None
4            NaN
5           None
Name: email, dtype: object

In [12]:
df.count

<bound method DataFrame.count of   first last        email   age
0   Jef  Jon  jef@com.com    33
1   Jon  Car  jon@com.com    55
2   Car  Jef  car@com.com    63
3   NaN  NaN         None  None
4  None  NaN          NaN  None
5   NaN  NaN         None   NaN>

In [13]:
df[['last', 'email']]

  last        email
0  Jon  jef@com.com
1  Car  jon@com.com
2  Jef  car@com.com
3  NaN         None
4  NaN          NaN
5  NaN         None

In [14]:
df.columns

Index(['first', 'last', 'email', 'age'], dtype='object')

In [15]:
df.iloc[[0]]

  first last        email age
0   Jef  Jon  jef@com.com  33

In [16]:
df.iloc[[0, 1]]

  first last        email age
0   Jef  Jon  jef@com.com  33
1   Jon  Car  jon@com.com  55

In [17]:
df.loc[[0, 1], 'email']

0    jef@com.com
1    jon@com.com
Name: email, dtype: object

In [18]:
df.loc[[0, 1], ['email', 'last']]

         email last
0  jef@com.com  Jon
1  jon@com.com  Car

In [19]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [20]:
df.set_index('email', inplace=True)

In [21]:
df

            first last   age
email
jef@com.com   Jef  Jon    33
jon@com.com   Jon  Car    55
car@com.com   Car  Jef    63
NaN           NaN  NaN  None
NaN          None  NaN  None
NaN           NaN  NaN   NaN

In [22]:
df.index

Index(['jef@com.com', 'jon@com.com', 'car@com.com', None, nan, None], dtype='object', name='email')

In [23]:
df.iloc[0]

first    Jef
last     Jon
age       33
Name: jef@com.com, dtype: object

In [24]:
df.reset_index(inplace=True)

In [25]:
df

         email first last   age
0  jef@com.com   Jef  Jon    33
1  jon@com.com   Jon  Car    55
2  car@com.com   Car  Jef    63
3         None   NaN  NaN  None
4          NaN  None  NaN  None
5         None   NaN  NaN   NaN

In [26]:
filt = (df['last'] == 'Car')

In [27]:
df[filt]

         email first last age
1  jon@com.com   Jon  Car  55

In [28]:
df = pd.DataFrame(people)

In [29]:
df.columns

Index(['first', 'last', 'email', 'age'], dtype='object')

In [30]:
#df.columns = ['first_name', 'last_name', 'email']

In [31]:
df.columns

Index(['first', 'last', 'email', 'age'], dtype='object')

In [32]:
df.columns = [up.upper() for up in df.columns]
df

  FIRST     LAST        EMAIL      AGE
0   Jef      Jon  jef@com.com       33
1   Jon      Car  jon@com.com       55
2   Car      Jef  car@com.com       63
3   NaN      NaN         None     None
4  None      NaN          NaN     None
5    NA  Missing         None  Missing

In [33]:
df.columns = df.columns.str.replace(' ', '-')
df

  FIRST     LAST        EMAIL      AGE
0   Jef      Jon  jef@com.com       33
1   Jon      Car  jon@com.com       55
2   Car      Jef  car@com.com       63
3   NaN      NaN         None     None
4  None      NaN          NaN     None
5    NA  Missing         None  Missing

In [34]:
df.columns = [up.lower() for up in df.columns]
df

  first     last        email      age
0   Jef      Jon  jef@com.com       33
1   Jon      Car  jon@com.com       55
2   Car      Jef  car@com.com       63
3   NaN      NaN         None     None
4  None      NaN          NaN     None
5    NA  Missing         None  Missing

In [35]:
df.rename(columns={'first-name':'firstname', 'last-name':'lastname'})#,inplace=True

  first     last        email      age
0   Jef      Jon  jef@com.com       33
1   Jon      Car  jon@com.com       55
2   Car      Jef  car@com.com       63
3   NaN      NaN         None     None
4  None      NaN          NaN     None
5    NA  Missing         None  Missing

In [37]:
#df.loc[2] = ['Jef', 'Car', 'jefcar@com.com']
df

  first     last        email      age
0   Jef      Jon  jef@com.com       33
1   Jon      Car  jon@com.com       55
2   Car      Jef  car@com.com       63
3   NaN      NaN         None     None
4  None      NaN          NaN     None
5    NA  Missing         None  Missing

In [38]:
df.loc[2, ['last_name', 'email']] = ['Mel', 'jefmel@com.com']
df

  first     last           email      age last_name
0   Jef      Jon     jef@com.com       33       NaN
1   Jon      Car     jon@com.com       55       NaN
2   Car      Jef  jefmel@com.com       63       Mel
3   NaN      NaN            None     None       NaN
4  None      NaN             NaN     None       NaN
5    NA  Missing            None  Missing       NaN

In [39]:
df.loc[2, 'last_name'] = 'Car'
df

  first     last           email      age last_name
0   Jef      Jon     jef@com.com       33       NaN
1   Jon      Car     jon@com.com       55       NaN
2   Car      Jef  jefmel@com.com       63       Car
3   NaN      NaN            None     None       NaN
4  None      NaN             NaN     None       NaN
5    NA  Missing            None  Missing       NaN

In [40]:
df.at[2, 'last_name'] = 'Mel'
df

  first     last           email      age last_name
0   Jef      Jon     jef@com.com       33       NaN
1   Jon      Car     jon@com.com       55       NaN
2   Car      Jef  jefmel@com.com       63       Mel
3   NaN      NaN            None     None       NaN
4  None      NaN             NaN     None       NaN
5    NA  Missing            None  Missing       NaN

In [41]:
df['email'].str.lower()

0       jef@com.com
1       jon@com.com
2    jefmel@com.com
3              None
4               NaN
5              None
Name: email, dtype: object

In [42]:
df['email'] = df['email'].str.lower()
df

  first     last           email      age last_name
0   Jef      Jon     jef@com.com       33       NaN
1   Jon      Car     jon@com.com       55       NaN
2   Car      Jef  jefmel@com.com       63       Mel
3   NaN      NaN            None     None       NaN
4  None      NaN             NaN     None       NaN
5    NA  Missing            None  Missing       NaN

In [50]:
#df['email'].apply(len)

In [51]:
def upper_case_email(email):
    return email.upper()

In [53]:
#df['email'].apply(upper_case_email)

In [55]:
#df['email'] = df['email'].apply(upper_case_email)
df

  first     last           email      age last_name
0   Jef      Jon     jef@com.com       33       NaN
1   Jon      Car     jon@com.com       55       NaN
2   Car      Jef  jefmel@com.com       63       Mel
3   NaN      NaN            None     None       NaN
4  None      NaN             NaN     None       NaN
5    NA  Missing            None  Missing       NaN

In [57]:
#df['email'] = df['email'].apply(lambda dc: dc.lower())
df

  first     last           email      age last_name
0   Jef      Jon     jef@com.com       33       NaN
1   Jon      Car     jon@com.com       55       NaN
2   Car      Jef  jefmel@com.com       63       Mel
3   NaN      NaN            None     None       NaN
4  None      NaN             NaN     None       NaN
5    NA  Missing            None  Missing       NaN

In [58]:
df.columns

Index(['first', 'last', 'email', 'age', 'last_name'], dtype='object')

In [59]:
df.apply(len)#The amount members values in columns

first        6
last         6
email        6
age          6
last_name    6
dtype: int64

In [62]:
#df.apply(lambda x: x.min())

In [64]:
#df.applymap(len)

In [66]:
#df.applymap(str.lower)

In [68]:
#df['fullname'] = df['first_name'] + ' ' + df['last_name']
df

  first     last           email      age last_name
0   Jef      Jon     jef@com.com       33       NaN
1   Jon      Car     jon@com.com       55       NaN
2   Car      Jef  jefmel@com.com       63       Mel
3   NaN      NaN            None     None       NaN
4  None      NaN             NaN     None       NaN
5    NA  Missing            None  Missing       NaN

In [70]:
#df.drop(columns=['first_name', 'last_name'], inplace=True)

In [ ]:
#df['fullname'].str.split(' ', expand=True)

In [71]:
#df[['firstname', 'lastname']] = df['fullname'].str.split(' ', expand=True)

In [72]:
df

  first     last           email      age last_name
0   Jef      Jon     jef@com.com       33       NaN
1   Jon      Car     jon@com.com       55       NaN
2   Car      Jef  jefmel@com.com       63       Mel
3   NaN      NaN            None     None       NaN
4  None      NaN             NaN     None       NaN
5    NA  Missing            None  Missing       NaN

In [74]:
#df.drop(columns=['fullname'])

In [75]:
#df.append({'firstname':'Ana'}, ignore_index=True)

In [76]:
people = {
    "firstname": ["Jeferson", "Jonatas"],
    "lastname": ["Melo", "Carneiro"],
    "email": ["jeferson@com.com", "jonatas@com.com"]
}
df_2 = pd.DataFrame(people)

In [77]:
df_2

  firstname  lastname             email
0  Jeferson      Melo  jeferson@com.com
1   Jonatas  Carneiro   jonatas@com.com

In [78]:
df.append(df_2)

  first     last             email      age last_name firstname  lastname
0   Jef      Jon       jef@com.com       33       NaN       NaN       NaN
1   Jon      Car       jon@com.com       55       NaN       NaN       NaN
2   Car      Jef    jefmel@com.com       63       Mel       NaN       NaN
3   NaN      NaN              None     None       NaN       NaN       NaN
4  None      NaN               NaN     None       NaN       NaN       NaN
5    NA  Missing              None  Missing       NaN       NaN       NaN
0   NaN      NaN  jeferson@com.com      NaN       NaN  Jeferson      Melo
1   NaN      NaN   jonatas@com.com      NaN       NaN   Jonatas  Carneiro

In [79]:
df.append(df_2, ignore_index=True, sort=False)

  first     last             email      age last_name firstname  lastname
0   Jef      Jon       jef@com.com       33       NaN       NaN       NaN
1   Jon      Car       jon@com.com       55       NaN       NaN       NaN
2   Car      Jef    jefmel@com.com       63       Mel       NaN       NaN
3   NaN      NaN              None     None       NaN       NaN       NaN
4  None      NaN               NaN     None       NaN       NaN       NaN
5    NA  Missing              None  Missing       NaN       NaN       NaN
6   NaN      NaN  jeferson@com.com      NaN       NaN  Jeferson      Melo
7   NaN      NaN   jonatas@com.com      NaN       NaN   Jonatas  Carneiro

In [80]:
#filter_lastname = df['lastname']=='Car'
#df.drop(index=df[filter_lastname].index)

In [82]:
#df.sort_values(by='firstname')

In [ ]:
#df.sort_values(by='firstname', ascending=False)

In [ ]:
#df.sort_values(by=['firstname', 'lastname'], ascending=False)

In [ ]:
#df.sort_values(by=['firstname', 'lastname'], ascending=[False, True], inplace=True)
df

In [83]:
df.sort_index()

  first     last           email      age last_name
0   Jef      Jon     jef@com.com       33       NaN
1   Jon      Car     jon@com.com       55       NaN
2   Car      Jef  jefmel@com.com       63       Mel
3   NaN      NaN            None     None       NaN
4  None      NaN             NaN     None       NaN
5    NA  Missing            None  Missing       NaN

In [85]:
#df['fullname'].sort_values()

In [86]:
df.columns

Index(['first', 'last', 'email', 'age', 'last_name'], dtype='object')

In [87]:
df.dropna()

  first last           email age last_name
2   Car  Jef  jefmel@com.com  63       Mel

In [88]:
df.dropna(axis='index', how='all', subset=['last', 'email'])

  first     last           email      age last_name
0   Jef      Jon     jef@com.com       33       NaN
1   Jon      Car     jon@com.com       55       NaN
2   Car      Jef  jefmel@com.com       63       Mel
5    NA  Missing            None  Missing       NaN

In [89]:
df.isna()

   first   last  email    age  last_name
0  False  False  False  False       True
1  False  False  False  False       True
2  False  False  False  False      False
3   True   True   True   True       True
4   True   True   True   True       True
5  False  False   True  False       True

In [90]:
df.fillna(0)

  first     last           email      age last_name
0   Jef      Jon     jef@com.com       33         0
1   Jon      Car     jon@com.com       55         0
2   Car      Jef  jefmel@com.com       63       Mel
3     0        0               0        0         0
4     0        0               0        0         0
5    NA  Missing               0  Missing         0

In [91]:
df.dtypes

first        object
last         object
email        object
age          object
last_name    object
dtype: object

In [106]:
df['age'] = df['age'].astype(float)

In [107]:
df.dtypes

first         object
last          object
email         object
age          float64
last_name     object
dtype: object